app/controllers/photos_controller.rb

  def index
    @photos = Photo.paginate(:page => params[:page], :per_page => 5, :order => 'created_at desc')
---
SELECT * FROM "photos" ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "photos"

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 0)